In [25]:
import pandas as pd

In [44]:
df_commun = pd.read_csv('Donnees/geographique/communes_france.csv', sep=';')

In [45]:
df_commun.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34876 entries, 0 to 34875
Data columns (total 1 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   code_commune,nom_comm  34876 non-null  object
dtypes: object(1)
memory usage: 272.6+ KB

In [46]:
df_commun.head()

                  code_commune,nom_comm
0  une,code_departement,nom_departement
1  01001,L'Abergement-Clémenciat,01,Ain
2    01002,L'Abergement-de-Varey,01,Ain
3        01004,Ambérieu-en-Bugey,01,Ain
4      01005,Ambérieux-en-Dombes,01,Ain

In [47]:
df_commun[['code_commune','nom_comm']] = df_commun['code_commune,nom_comm'].str.split(',', n=1, expand=True)

In [48]:
df_commun.head()

,"code_commune,nom_comm",code_commune,nom_comm
0,"une,code_departement,nom_departement",une,"code_departement,nom_departement"
1,"01001,L'Abergement-Clémenciat,01,Ain",01001,"L'Abergement-Clémenciat,01,Ain"
2,"01002,L'Abergement-de-Varey,01,Ain",01002,"L'Abergement-de-Varey,01,Ain"
3,"01004,Ambérieu-en-Bugey,01,Ain",01004,"Ambérieu-en-Bugey,01,Ain"
4,"01005,Ambérieux-en-Dombes,01,Ain",01005,"Ambérieux-en-Dombes,01,Ain"

In [49]:
df_commun.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34876 entries, 0 to 34875
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   code_commune,nom_comm  34876 non-null  object
 1   code_commune           34876 non-null  object
 2   nom_comm               34876 non-null  object
dtypes: object(3)
memory usage: 817.5+ KB

In [50]:
df_commun.drop(columns=['code_commune,nom_comm'], inplace=True)

In [55]:
df_commun.head()

  code_commune                          nom_comm
0          une  code_departement,nom_departement
1        01001    L'Abergement-Clémenciat,01,Ain
2        01002      L'Abergement-de-Varey,01,Ain
3        01004          Ambérieu-en-Bugey,01,Ain
4        01005        Ambérieux-en-Dombes,01,Ain

In [ ]:
##df_commun = df_commun.apply(lambda x: x.astype(str) if x.astype(str)==True )
df_commun['code_commune'] = pd.to_numeric(df_commun['code_commune'], errors='coerce')

In [58]:
df_commun.dropna(inplace=True)

In [59]:
df_commun['code_commune'] = df_commun['code_commune'].astype(int)

In [61]:
df_commun.info()

<class 'pandas.core.frame.DataFrame'>
Index: 34515 entries, 1 to 34875
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   code_commune  34515 non-null  int32
 1   nom_comm      34515 non-null  object
dtypes: int32(1), object(1)
memory usage: 674.1+ KB

In [63]:
df_commun.head()

   code_commune                        nom_comm
1          1001  L'Abergement-Clémenciat,01,Ain
2          1002    L'Abergement-de-Varey,01,Ain
3          1004        Ambérieu-en-Bugey,01,Ain
4          1005      Ambérieux-en-Dombes,01,Ain
5          1006                  Ambléon,01,Ain

In [64]:
df_commun.to_csv('Donnees/geographique/communes_france_clean.csv', sep=';', index=False)

In [65]:
### Deprecated code

In [76]:
df_depa=pd.read_csv('Donnees\geographique\departement_france.csv')

<>:1: SyntaxWarning: invalid escape sequence '\g'
<>:1: SyntaxWarning: invalid escape sequence '\g'
C:\Users\pc\AppData\Local\Temp\ipykernel_11828\3882958379.py:1: SyntaxWarning: invalid escape sequence '\g'
  df_depa=pd.read_csv('Donnees\geographique\departement_france.csv')

In [77]:
df_depa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nom         101 non-null    object
 1   code        101 non-null    object
 2   codeRegion  101 non-null    int64
dtypes: int64(1), object(2)
memory usage: 2.5+ KB

In [78]:
df_depa.head()

                       nom code  codeRegion
0                      Ain   01          84
1                    Aisne   02          32
2                   Allier   03          84
3  Alpes-de-Haute-Provence   04          93
4             Hautes-Alpes   05          93

In [81]:
df_depa.loc[(df_depa['codeRegion']=='94') | (df_depa['nom']=='Corse-du-Sud')]

             nom code  codeRegion
28  Corse-du-Sud   2A          94

In [82]:
df_depa.loc[(df_depa['codeRegion']=='94') | (df_depa['nom']=='Haute-Corse')]

            nom code  codeRegion
29  Haute-Corse   2B          94

In [90]:
df_depa.loc[(df_depa['codeRegion']=='94') | (df_depa['code']=='04')]

                       nom code  codeRegion
3  Alpes-de-Haute-Provence   04          93

In [91]:
df_depa.isna().sum()

nom           0
code          0
codeRegion    0
dtype: int64

In [92]:
df_depa['code'] = pd.to_numeric(df_depa['code'], errors='coerce')

In [93]:
df_depa.isna().sum()

nom           0
code          2
codeRegion    0
dtype: int64

In [94]:
df_depa.loc[df_depa['code'].isna()]

             nom  code  codeRegion
28  Corse-du-Sud   NaN          94
29   Haute-Corse   NaN          94

In [96]:
df_depa.dropna(inplace=True)

In [97]:
df_depa.to_csv('Donnees/geographique/departement_france_clean.csv', sep=';', index=False)

In [98]:
### Region code

In [104]:
df_region = pd.read_csv('Donnees/geographique/region_france.csv', sep=';')

In [105]:
df_region.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   nom,code  101 non-null    object
dtypes: object(1)
memory usage: 940.0+ bytes

In [107]:
df_region[['nom_region','code_region']] = df_region['nom,code'].str.split(',', expand=True)

In [108]:
df_region['code_region'] = pd.to_numeric(df_region['code_region'], errors='coerce')

In [109]:
df_region.isna().sum()

nom,code       0
nom_region     0
code_region    2
dtype: int64

In [110]:
df_region.dropna(inplace=True)

In [111]:
df_region['code_region'] = df_region['code_region'].astype(int)
df_region.drop(columns=['nom,code'], inplace=True)

In [112]:
df_region.head()

                nom_region  code_region
0                      Ain            1
1                    Aisne            2
2                   Allier            3
3  Alpes-de-Haute-Provence            4
4             Hautes-Alpes            5

In [114]:
df_region.info()

<class 'pandas.core.frame.DataFrame'>
Index: 99 entries, 0 to 100
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   nom_region   99 non-null     object
 1   code_region  99 non-null     int32
dtypes: int32(1), object(1)
memory usage: 1.9+ KB

In [115]:
df_region.to_csv('Donnees/geographique/region_france_clean.csv', sep=';', index=False)